MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX330F064L.atdf
      <value-group caption="8/16-bit Mode bit" name="PMMODE__MODE16">
         <value caption="16-bit mode: a read or write to the data register invokes a single 16-bit transfer" name="" value="0x1" />
         <value caption="8-bit mode: a read or write to the data register invokes a single 8-bit transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Increment Mode bits" name="PMMODE__INCM">
         <value caption="Slave mode read and write buffers auto-increment (MODE(1:0) = 00 only)" name="" value="0x3" />
         <value caption="Decrement ADDR(15:0) by 1 every read/write cycle" name="" value="0x2" />
         <value caption="Increment ADDR(15:0) by 1 every read/write cycle" name="" value="0x1" />
         <value caption="No increment or decrement of address" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Request Mode bits" name="PMMODE__IRQM">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Interrupt generated when Read Buffer 3 is read or Write Buffer 3 is written (Buffered PSP mode) or on a read or write operation when PMA(1:0) =11 (Addressable Slave mode only)" name="" value="0x2" />
         <value caption="Interrupt generated at the end of the read/write cycle" name="" value="0x1" />
         <value caption="No Interrupt generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Busy bit (Master mode only)" name="PMMODE__BUSY">
         <value caption="Port is busy" name="" value="0x1" />
         <value caption="Port is not busy" name="" value="0x0" />
      </value-group>
      <value-group caption="Address bits" name="PMADDR__ADDR">
         <value caption="address is 0" name="" value="0x0" />
         <value caption="address is 0x3fff" name="" value="0x3fff" />
      </value-group>
      <value-group caption="Chip Select 1 bit" name="PMADDR__CS1">
         <value caption="Chip Select 1 is active" name="" value="0x1" />
         <value caption="Chip Select 1 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="Chip Select 2 bit" name="PMADDR__CS2">
         <value caption="Chip Select 2 is active" name="" value="0x1" />
         <value caption="Chip Select 2 is inactive" name="" value="0x0" />
      </value-group>
      <value-group caption="PMALH/PMALL Strobe Enable bits" name="PMAEN__PTEN">
         <value caption="PMA1 and PMA0 function as either PMA(1:0) or PMALH and PMALL" name="" value="0x3" />
         <value caption="PMA1 and PMA0 pads function as port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="PMP Address Port Enable bits" name="PMAEN__PTEN2">
         <value caption="PMA(13:2) function as PMP address lines" name="" value="0xfff" />
         <value caption="PMA(13:2) function as port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="PMCS1 Address Port Enable bits" name="PMAEN__PTEN14">
         <value caption="PMCS1" name="" value="0x3" />
         <value caption="PMCS1 functions as port I/O" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Underflow Status bit" name="PMSTAT__OBUF">
         <value caption="A read occurred from an empty output byte buffer (must be cleared in software)" name="" value="0x1" />
         <value caption="No underflow occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Buffer Empty Status bit" name="PMSTAT__OBE">
         <value caption="All readable output buffer registers are empty" name="" value="0x1" />
         <value caption="Some or all of the readable output buffer registers are full" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Overflow Status bit" name="PMSTAT__IBOV">
         <value caption="A write attempt to a full input byte buffer occurred (must be cleared in software)" name="" value="0x1" />
         <value caption="No overflow occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Buffer Full Status bit" name="PMSTAT__IBF">
         <value caption="All writable input buffer registers are full" name="" value="0x1" />
         <value caption="Some or all of the writable input buffer registers are empty" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02028" name="RCON" version="4">
      <register-group name="RCON">
         <register caption="Reset Control Register" name="RCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Power-on Reset Flag bit" mask="0x00000001" name="POR" values="RCON__POR" />
            <bitfield caption="Brown-out Reset Flag bit" mask="0x00000002" name="BOR" values="RCON__BOR" />
            <bitfield caption="Wake From Idle Flag bit" mask="0x00000004" name="IDLE" values="RCON__IDLE" />
            <bitfield caption="Wake From Sleep Flag bit" mask="0x00000008" name="SLEEP" values="RCON__SLEEP" />
            <bitfield caption="Watchdog Timer Time-out Flag bit" mask="0x00000010" name="WDTO" values="RCON__WDTO" />
            <bitfield caption="Software Reset Flag bit" mask="0x00000040" name="SWR" values="RCON__SWR" />
            <bitfield caption="External Reset Pin Flag bit" mask="0x00000080" name="EXTR" values="RCON__EXTR" />
            <bitfield caption="Voltage Regulator Standby Enable bit" mask="0x00000100" name="VREGS" values="RCON__VREGS" />
            <bitfield caption="Configuration Mismatch Reset Flag bit" mask="0x00000200" name="CMR" values="RCON__CMR" />
            <bitfield caption="High Voltage Detect Reset Flag bit" mask="0x20000000" name="HVDR" values="RCON__HVDR" />
         </register>
         <register caption="Software Reset Register" name="RSWRST" offset="0x10" rw="RW" size="4">
            <bitfield caption="Software Reset Trigger bit" mask="0x00000001" name="SWRST" values="RSWRST__SWRST" />
         </register>
      </register-group>
      <value-group caption="Power-on Reset Flag bit" name="RCON__POR">
         <value caption="Power-on Reset has occurred" name="" value="0x1" />
         <value caption="Power-on Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Brown-out Reset Flag bit" name="RCON__BOR">
         <value caption="Brown-out Reset has occurred" name="" value="0x1" />
         <value caption="Brown-out Reset has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Idle Flag bit" name="RCON__IDLE">
         <value caption="Device was in Idle mode" name="" value="0x1" />
         <value caption="Device was not in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake From Sleep Flag bit" name="RCON__SLEEP">
         <value caption="Device was in Sleep mode" name="" value="0x1" />
         <value caption="Device was not in Sleep mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Watchdog Timer Time-out Flag bit" name="RCON__WDTO">
         <value caption="WDT Time-out has occurred" name="" value="0x1" />
         <value caption="WDT Time-out has not occurred" name="" value="0x0" />
      </value-group>
